# Описание

**employees** Таблица с информацией по сотрудникам

- emp_no - id сотрудника
- title - Название должности
- birth_date - дата рождения
- first_name - Имя
- first_name - Фамилия
- gender - пол
- hire_date - первая дата устройства на работу

**dept_emp** - Таблица с информацией в каком департаменте работает сотрудник

- emp_no - id сотрудника
- dept_name - Название департамента
- from_date - дата начала работы в департаменте
- to_date - дата ококнчания работы в департаменте (если 9999-01-01 - то работает по наст время)


**dept_manager** - Таблица с информацией в каком департаменте работает менеджер

- emp_no - id менеджера (сотрудника)
- dept_name - Название департамента
- from_date - дата начала работы в департаменте
- to_date - дата ококнчания работы в департаменте (если 9999-01-01 - то работает по наст время)


**salaries** - Таблица с информацией о зарплатах сотрудников

- emp_no - id сотрудника
- salaries - Зарплата

In [1]:
%load_ext sql

Укажите путь до места сохранения EmployeeSQL.db, данный путь был приведен в качестве примера

In [2]:
%sql sqlite:///../../data/EmployeeSQL/EmployeeSQL.db

In [3]:
%%sql

SELECT name FROM sqlite_master

 * sqlite:///../../data/EmployeeSQL/EmployeeSQL.db
Done.

[('employees',),
 ('dept_manager',),
 ('dept_emp',),
 ('salaries',),
 ('uniq_empl',)]

1) Выведите первые 10 строк из таблицы dept_emp

In [4]:
%%sql

select *
from dept_emp
limit 10

 * sqlite:///../../data/EmployeeSQL/EmployeeSQL.db
Done.

[(10001, 'Development', '1986-06-26', '9999-01-01'),
 (10002, 'Sales', '1996-08-03', '9999-01-01'),
 (10003, 'Production', '1995-12-03', '9999-01-01'),
 (10004, 'Production', '1986-12-01', '9999-01-01'),
 (10005, 'Human Resources', '1989-09-12', '9999-01-01'),
 (10006, 'Development', '1990-08-05', '9999-01-01'),
 (10007, 'Research', '1989-02-10', '9999-01-01'),
 (10008, 'Development', '1998-03-11', '2000-07-31'),
 (10009, 'Quality Management', '1985-02-18', '9999-01-01'),
 (10010, 'Production', '1996-11-24', '2000-06-26')]

2) Создать таблицу employees_2 на основании employees, где создадите дополнительные столбцы:
- месяц рождения (по столбцу birth_date)
- год рождения (по столбцу birth_date)

Проверьте, создалась ли таблица. Выведите первые 5 строк

In [5]:
%%sql

create table employees_2 as
select *,
    strftime('%m', birth_date) as month,
    strftime('%Y', birth_date) as year
from employees;

 * sqlite:///../../data/EmployeeSQL/EmployeeSQL.db
Done.
(sqlite3.OperationalError) cannot commit - no transaction is active
[SQL: COMMIT;]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

In [6]:
%%sql

select *
from employees_2
limit 5

 * sqlite:///../../data/EmployeeSQL/EmployeeSQL.db
Done.

[(10001, 'Senior Engineer', '1953-09-02', 'Georgi', 'Facello', 'M', '1986-06-26', '09', '1953'),
 (10002, 'Staff', '1964-06-02', 'Bezalel', 'Simmel', 'F', '1985-11-21', '06', '1964'),
 (10003, 'Senior Engineer', '1959-12-03', 'Parto', 'Bamford', 'M', '1986-08-28', '12', '1959'),
 (10004, 'Senior Engineer', '1954-05-01', 'Chirstian', 'Koblick', 'M', '1986-12-01', '05', '1954'),
 (10005, 'Staff', '1955-01-21', 'Kyoichi', 'Maliniak', 'M', '1989-09-12', '01', '1955')]

3) Удалите таблицу employees_2

In [7]:
%%sql

drop table employees_2;
COMMIT;

 * sqlite:///../../data/EmployeeSQL/EmployeeSQL.db
Done.
(sqlite3.OperationalError) cannot commit - no transaction is active
[SQL: COMMIT;]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

4) Найдите всех сотрудников чье имя Georgi. Выведите первые 5 строк

In [8]:
%%sql

select *
from employees
where first_name = 'Georgi'
limit 5

 * sqlite:///../../data/EmployeeSQL/EmployeeSQL.db
Done.

[(10001, 'Senior Engineer', '1953-09-02', 'Georgi', 'Facello', 'M', '1986-06-26'),
 (10909, 'Senior Engineer', '1954-11-11', 'Georgi', 'Atchley', 'M', '1985-04-21'),
 (11029, 'Senior Staff', '1962-07-12', 'Georgi', 'Itzfeldt', 'M', '1992-12-27'),
 (11430, 'Staff', '1957-01-23', 'Georgi', 'Klassen', 'M', '1996-02-27'),
 (12157, 'Staff', '1960-03-30', 'Georgi', 'Barinka', 'M', '1985-06-04')]

5) Найдите всех сотрудников чье имя Georgi, которые до сих пор работают в компании (использовать также таблицу dept_emp, поле to_date = 9999-01-01). 

Выведите первые 5 строк, содержащих **имя, фамилию, должность, дату начала работы, а также дату окончания работы (из dept_emp)**

In [9]:
%%sql

select e.first_name, e.last_name, e.title, e.hire_date, d.to_date
from employees e
inner join dept_emp d on e.emp_no = d.emp_no
where first_name = 'Georgi'
limit 5

 * sqlite:///../../data/EmployeeSQL/EmployeeSQL.db
Done.

[('Georgi', 'Facello', 'Senior Engineer', '1986-06-26', '9999-01-01'),
 ('Georgi', 'Atchley', 'Senior Engineer', '1985-04-21', '9999-01-01'),
 ('Georgi', 'Itzfeldt', 'Senior Staff', '1992-12-27', '9999-01-01'),
 ('Georgi', 'Klassen', 'Staff', '1996-02-27', '9999-01-01'),
 ('Georgi', 'Barinka', 'Staff', '1985-06-04', '9999-01-01')]

6) Вывести топ 2 заплаты в каждом департаменте. 

Подсказка:

**Использовать оконные функции**, можно и виртуальные таблицы, аккуратно производите нумерацию, использовать сортировку по убыванию в самой оконной функции, а также JOIN. Если в департаменте несколько похожих зарплат, то учитывать только **уникальное значение**!

Пример вывода:

| dept_name        | salary|
|--------------|-----------|
|Customer Service | 1000|
|Customer Service | 999|
|Development      | 1000|
|Development      | 999|

In [4]:
%%sql


with max_salary as (
    select distinct d.dept_name, s.salary,
    DENSE_RANK() OVER (PARTITION BY d.dept_name ORDER BY s.salary desc) as rn
    from dept_emp d
    inner join salaries s on d.emp_no = s.emp_no
)
select *
from max_salary
where rn <= 2

 * sqlite:///../../data/EmployeeSQL/EmployeeSQL.db
Done.

[('Customer Service', 122423, 1),
 ('Customer Service', 120032, 2),
 ('Development', 110449, 1),
 ('Development', 106109, 2),
 ('Finance', 114784, 1),
 ('Finance', 113236, 2),
 ('Human Resources', 110308, 1),
 ('Human Resources', 101593, 2),
 ('Marketing', 118250, 1),
 ('Marketing', 116412, 2),
 ('Production', 104390, 1),
 ('Production', 104065, 2),
 ('Quality Management', 95634, 1),
 ('Quality Management', 93532, 2),
 ('Research', 105384, 1),
 ('Research', 102661, 2),
 ('Sales', 129492, 1),
 ('Sales', 127238, 2)]

7) Найдите 2 по счету максимальную зарплату **среди менеджеров** **двумя способами обязательно!**:
- с использованием подзапроса
- с использованием limit

Вывести id менеджера и значение зарплаты

In [11]:
%%sql


select distinct d.emp_no, max(s.salary)
from dept_manager d
inner join salaries s on d.emp_no = s.emp_no
where s.salary not in (
                        select max(s.salary)
                        from dept_manager d
                        inner join salaries s on d.emp_no = s.emp_no                        
)

 * sqlite:///../../data/EmployeeSQL/EmployeeSQL.db
Done.

[(111035, 71612)]

In [12]:
%%sql


select distinct d.emp_no, s.salary
from dept_manager d
inner join salaries s on d.emp_no = s.emp_no
order by s.salary desc
limit 1, 1

 * sqlite:///../../data/EmployeeSQL/EmployeeSQL.db
Done.

[(111035, 71612)]

8) Вывести среднюю зарплату и название тех депаратаментов (dept_emp), где **среднее значение зарплаты** больше 50000


Пример вывода:

|dept_name        | avg salary|
|------|------|
|Customer Service | 51000|
|Development      | 50500|

In [13]:
%%sql

select d.dept_name, avg(s.salary) avg_salary
from dept_emp d
inner join salaries s on d.emp_no = s.emp_no
group by d.dept_name
having avg(s.salary) > 50000

 * sqlite:///../../data/EmployeeSQL/EmployeeSQL.db
Done.

[('Finance', 59533.51654560129),
 ('Marketing', 61095.89738261343),
 ('Sales', 69832.12715092354)]

9) Выведите среднюю зарплату **по всем сотрудникам** и округлите при помощи round()

In [18]:
%%sql

select round(avg(salary))
from salaries

 * sqlite:///../../data/EmployeeSQL/EmployeeSQL.db
Done.

[(52971.0,)]

10) Выведите первые 10 строк:
- id сотрудника (относится ко всем сотрудникам)
- Имя сотрудника
- Фамилию сотрудника
- Должность
- Департамент
- Зарплату (иметь в виду, что это число, а не строка)
- Дату начала работы в департаменте
- Дату окончания работы в департаменте
- **Флаг** того, что человек работает в данном депаратаменте (**если стоит дата 9999-01-01, то человек продолжает работать и ставим 1, иначе 0 (то есть уже не работает)**)
- Флаг того, что его зарплата выше средней, если **1 - выше средней или равно, иначе 0** (значение расчитано в задании 9, можно скопировать значение руками)

Используйте CASE

In [26]:
%%sql

select e.emp_no, e.first_name, e.last_name, e.title, d.dept_name, s.salary, 
d.from_date, d.to_date,
case when to_date = '9999-01-01' then 1 else 0 end as flg_end,
case when salary > 52971 then 1 else 0 end as flg_sal

from employees e
    inner join dept_emp d on e.emp_no = d.emp_no
    inner join salaries s on e.emp_no = s.emp_no

where last_name='Facello' and first_name='Georgi'
limit 10

 * sqlite:///../../data/EmployeeSQL/EmployeeSQL.db
Done.

[(10001, 'Georgi', 'Facello', 'Senior Engineer', 'Development', 60117, '1986-06-26', '9999-01-01', 1, 1),
 (55649, 'Georgi', 'Facello', 'Senior Engineer', 'Quality Management', 51154, '1993-07-02', '1995-04-27', 0, 0)]

11) Найдите **кол-во** уникальных сотрудников **в каждом департаменте** в разрезе **должности**

Пример вывода:

|dept_name	| title	| count_emp|
|------|-----|----|
|Development	| Engineer |	20|
|Development	| Staff    |	10|

In [ ]:
# Ваш код

In [3]:
%%sql

select d.dept_name, e.title, count(e.emp_no) as cnt
from employees e
inner join dept_emp d on e.emp_no = d.emp_no
GROUP BY d.dept_name, e.title
limit 10

 * sqlite:///../../data/EmployeeSQL/EmployeeSQL.db
Done.

[('Customer Service', 'Assistant Engineer', 108),
 ('Customer Service', 'Engineer', 944),
 ('Customer Service', 'Manager', 4),
 ('Customer Service', 'Senior Engineer', 2027),
 ('Customer Service', 'Senior Staff', 4041),
 ('Customer Service', 'Staff', 16147),
 ('Customer Service', 'Technique Leader', 309),
 ('Development', 'Assistant Engineer', 2987),
 ('Development', 'Engineer', 23938),
 ('Development', 'Manager', 2)]

In [8]:
%%sql
select distinct d.dept_name, e.title, count(e.emp_no) over (
                                       partition by d.dept_name, e.title) as count_emp
from dept_emp as d
inner join employees as e on d.emp_no = e.emp_no
limit 10

 * sqlite:///../../data/EmployeeSQL/EmployeeSQL.db
Done.

[('Customer Service', 'Assistant Engineer', 108),
 ('Customer Service', 'Engineer', 944),
 ('Customer Service', 'Manager', 4),
 ('Customer Service', 'Senior Engineer', 2027),
 ('Customer Service', 'Senior Staff', 4041),
 ('Customer Service', 'Staff', 16147),
 ('Customer Service', 'Technique Leader', 309),
 ('Development', 'Assistant Engineer', 2987),
 ('Development', 'Engineer', 23938),
 ('Development', 'Manager', 2)]

In [10]:
%%sql

select count(distinct e.emp_no) as cnt
from employees e

 * sqlite:///../../data/EmployeeSQL/EmployeeSQL.db
Done.

[(300024,)]